; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph4 - mode
	infrared1 - mode
	image0 - mode
	image5 - mode
	spectrograph2 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph2)
	(supports instrument0 image5)
	(supports instrument0 image0)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Star5 thermograph4)
	(have_image Phenomenon6 thermograph4)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 image0)
	(have_image Star7 infrared1)
	(have_image Planet8 thermograph4)
	(have_image Star9 image5)
	(have_image Star9 infrared1)
	(have_image Star10 spectrograph2)
	(have_image Star10 thermograph4)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon12 image0)
))

)

; plan
1. (turn_to satellite0 groundstation3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 0 of 14
5. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 1 of 14
6. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 14
7. (take_image satellite0 star10 instrument0 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 2 of 14
8. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 3 of 14
9. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 3 of 14
10. (take_image satellite0 planet8 instrument0 thermograph4)
   added: (have_image planet8 thermograph4)
   goals met: 4 of 14
11. (turn_to satellite0 phenomenon12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 14
12. (take_image satellite0 phenomenon12 instrument0 image3)
   added: (have_image phenomenon12 image3)
   goals met: 5 of 14
13. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 6 of 14
14. (turn_to satellite0 star5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star5)
   goals met: 6 of 14
15. (take_image satellite0 star5 instrument0 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 7 of 14
16. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 7 of 14
17. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 8 of 14
18. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 9 of 14
19. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 9 of 14
20. (take_image satellite0 star9 instrument0 image5)
   added: (have_image star9 image5)
   goals met: 10 of 14
21. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 11 of 14
22. (turn_to satellite0 phenomenon6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon6)
   goals met: 12 of 14
23. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 13 of 14
24. (take_image satellite0 phenomenon6 instrument0 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 14 of 14
